In [2]:
import pandas as pd

In [8]:
titanic_data = pd.read_csv('Titanic dataset.csv')

In [9]:
titanic_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

1. ## Kazada ölenlerin yaş ortalamasını bulunuz

In [27]:
avg_age_of_died = titanic_data[titanic_data['Survived'] == 0]['Age'].mean().round(2)

# I used round() function to round the value.

print(f"Kazada olenlerin yas ortalamasi: {avg_age_of_died }")

Kazada olenlerin yas ortalamasi: 30.63

2. ## Kazada ölenlerin bilet fiyatlarının ortalamasını ve medyanını bulunuz

In [63]:
avg_ticketPrice_of_died = titanic_data[titanic_data['Survived'] == 0]['Fare'].mean().round(2)
median_ticketPrice_of_died = titanic_data[titanic_data['Survived'] == 0]['Fare'].median().round(2)


print(f"Kazada olenlerin bilet fiyatlarının ortalaması: {avg_ticketPrice_of_died}")

print(f"Kazada olenlerin bilet fiyatlarının medyani: {median_ticketPrice_of_died}")

Kazada olenlerin bilet fiyatlarının ortalaması: 22.12
Kazada olenlerin bilet fiyatlarının medyani: 10.5

3. ## Kazada ölen erkeklerin yaş ortalamasını bulunuz

In [66]:
avg_age_of_died_men= titanic_data[(titanic_data['Survived'] == 0) & (titanic_data['Sex']== 'male')]['Age'].mean().round(2)

print(f"Kazada olen erkeklerin yas ortalaması: {avg_age_of_died_men}")

Kazada olen erkeklerin yas ortalaması: 31.62

4. ## Kazada ölen Kadınların yaş ortalamasını bulunuz

In [67]:
avg_age_of_died_women= titanic_data[(titanic_data['Survived'] == 0) & (titanic_data['Sex']== 'female')]['Age'].mean().round(2)

print(f"Kazada olen erkeklerin yas ortalaması: {avg_age_of_died_women}")

Kazada olen erkeklerin yas ortalaması: 25.05

5. ## Kazadan kurtulanların yaş ortalamasını bulunuz

In [43]:
avg_age_of_survived = titanic_data[(titanic_data['Survived'] == 1)]['Age'].mean().round(2)

print(f"Kazadan kurtulanlarin yas ortalaması: {avg_age_of_survived }")

Kazadan kurtulanlarin yas ortalaması: 28.34

6. ## Kazadan kurtulanların bilet fiyatlarının ortalamasını bulunuz

In [53]:
avg_price_of_survived = titanic_data[(titanic_data['Survived'] == 1)]['Fare'].mean().round(2)

print(f"Kazadan kurtulanlarin bilet fiyatlarinin ortalaması: {avg_price_of_survived }")

Kazadan kurtulanlarin bilet fiyatlarinin ortalaması: 48.4

7. ## Kazadan kurtulan toplam kişi sayısını bulunuz… (tüyo: len(df_titanic[(df_titanic.Survived==1)] kodu ile de bu sayıya ulaşabilirsiniz.)

In [57]:
total_survived = (titanic_data['Survived'] == 1).sum()

print(f"Kazadan kurtulanlarin toplam sayisi: {total_survived}")

Kazadan kurtulanlarin toplam sayisi: 342

8. ## 10 yaşından küçüklerin bilet fiyatlarının medyan değerini bulunuz

In [58]:
median_price_of_below10 = titanic_data[(titanic_data['Age'] < 10)]['Fare'].median().round(2)

print(f"10 yaşından küçüklerin bilet fiyatlarının medyani: {median_price_of_below10 }")

Kazadan kurtulanlarin bilet fiyatlarinin ortalaması: 27.0

9. ## 1.sınıf, 2.sınıf ve 3.sınıf bilet fiyatlarının ortalama ve medyanlarını karşılaştırınız. (Pclass değişkeni sınıfları barındırmaktadır.)

In [62]:
x = titanic_data.groupby(['Pclass']).agg({'Fare': ['mean', 'median']})
x

             Fare
             mean   median
Pclass
1       84.154687  60.2875
2       20.662183  14.2500
3       13.675550   8.0500

10. ## Kazada ölen kadınların oranı ile erkeklerin oranını karşılaştırınız. (Örnek: erkekler için; ölen erkeklerin, erkek sayısına bölümü bu oranı vermektedir.

In [94]:
# total women count
total_women_count = (titanic_data['Sex'] == 'female').sum()


# total men count
total_men_count = (titanic_data['Sex'] == 'male').sum()



died_women_ratio = ((titanic_data['Survived'] == 0) & (titanic_data['Sex'] == 'female')).sum() / total_women_count
print(f"Kazada olen kadin orani: {died_women_ratio:.2%}")

died_men_ratio = ((titanic_data['Survived'] == 0) & (titanic_data['Sex'] == 'male')).sum() / total_men_count
print(f"Kazada olen erkek orani: {died_men_ratio:.2%}")

Kazada olen kadin orani: 25.80%
Kazada olen erkek orani: 81.11%